DataProcessors/ТестовоеОприходованиеСерийнойНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ТестовоеОприходованиеСерийнойНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document._Инвойс</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>InformationRegister.ЦеныЗакупки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварУжеОплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_СкидкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_НеСоздаватьПриходную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументЗатрат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ИнвойсПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗамены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗатраты_</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_СуммаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументЗатрат</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВКД_ДополнительныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ТестовоеОприходованиеСерийнойНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Количество = 1;
	ПроводитьДокументы = Истина;
	
	Попытка
		Склад = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
	Исключение
	КонецПопытки;
	
	Если ГруппыНоменклатуры = Неопределено Тогда
		ГруппыНоменклатуры = Новый ТаблицаЗначений;
		ГруппыНоменклатуры.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьПослеПодтверждения", ЭтотОбъект),
		"Будут созданы приходные накладные и документ установки цен. Продолжить?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПодтверждения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Результат = ВыполнитьНаСервере();
	Исключение
		ПоказатьПредупреждение(Неопределено, ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Текст = СтрШаблон("Создано приходных накладных: %1.%2Создано документов установки цен: %3.%2Товаров: %4. Серий: %5.",
		Результат.ПриходныеНакладные,
		Символы.ПС,
		Результат.ДокументыУстановкиЦен,
		Результат.Товары,
		Результат.Серии);
	ПоказатьПредупреждение(Неопределено, Текст);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьНаСервере()
	
	ПроверитьПараметры();
	
	ТаблицаНоменклатуры = ПолучитьСерийнуюНоменклатуру();
	Если ТаблицаНоменклатуры.Количество() = 0 Тогда
		ВызватьИсключение "В выбранных группах не найдены товары с признаком учета по сериям.";
	КонецЕсли;
	
	Результат = Новый Структура("ПриходныеНакладные,ДокументыУстановкиЦен,Товары,Серии", 0, 0, ТаблицаНоменклатуры.Количество(), 0);
	
	НачатьТранзакцию();
	Попытка
		СоздатьПриходныеНакладные(ТаблицаНоменклатуры, Результат);
		СоздатьДокументУстановкиЦен(ТаблицаНоменклатуры, Результат);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьПараметры()
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		ВызватьИсключение "Укажите склад.";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ВызватьИсключение "Укажите поставщика для приходных накладных.";
	КонецЕсли;
	
	Если Количество <= 0 Тогда
		ВызватьИсключение "Количество каждого товара должно быть больше нуля.";
	КонецЕсли;
	
	Если Количество <> Цел(Количество) Тогда
		ВызватьИсключение "Количество каждого товара должно быть целым числом.";
	КонецЕсли;
	
	Если ПолучитьМассивГруппНоменклатуры().Количество() = 0 Тогда
		ВызватьИсключение "Добавьте хотя бы одну группу номенклатуры.";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивГруппНоменклатуры()
	
	МассивГрупп = Новый Массив;
	
	Для Каждого СтрокаГруппы Из ГруппыНоменклатуры Цикл
		Группа = СтрокаГруппы.Группа;
		Если НЕ ЗначениеЗаполнено(Группа) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ Группа.ЭтоГруппа Тогда
			ВызватьИсключение СтрШаблон("Значение %1 не является группой номенклатуры.", Группа);
		КонецЕсли;
		МассивГрупп.Добавить(Группа);
	КонецЦикла;
	
	Возврат МассивГрупп;
	
КонецФункции

&НаСервере
Функция ПолучитьСерийнуюНоменклатуру()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Группы", ПолучитьМассивГруппНоменклатуры());
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.ЭтоГруппа
	               |	И НЕ Номенклатура.ПометкаУдаления
	               |	И Номенклатура.УчетПоСериям
	               |	И Номенклатура.Ссылка В ИЕРАРХИИ(&Группы)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура СоздатьПриходныеНакладные(ТаблицаНоменклатуры, Результат)
	
	ТекущийДокумент = Неопределено;
	СтрокВДокументе = 0;
	СчетчикСерий = 0;
	
	Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
		Для Инд = 1 По Количество Цикл
			Если ТекущийДокумент = Неопределено Или СтрокВДокументе >= 1000 Тогда
				ЗаписатьПриходнуюНакладную(ТекущийДокумент, Результат);
				ТекущийДокумент = НовыйПриходнаяНакладная();
				СтрокВДокументе = 0;
			КонецЕсли;
			
			СчетчикСерий = СчетчикСерий + 1;
			Серия = СгенерироватьСерию(СчетчикСерий);
			
			НоваяСтрока = ТекущийДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаНоменклатуры.Номенклатура;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Серия = Серия;
			НоваяСтрока.ЦенаЗакупки = 1;
			НоваяСтрока.СуммаЗакупки = 1;
			НоваяСтрока.ВКД_ЦенаСоСкидкой = 1;
			НоваяСтрока.ВКД_ЦенаСЗатратами = 1;
			
			СтрокВДокументе = СтрокВДокументе + 1;
			Результат.Серии = Результат.Серии + 1;
		КонецЦикла;
	КонецЦикла;
	
	ЗаписатьПриходнуюНакладную(ТекущийДокумент, Результат);
	
КонецПроцедуры

&НаСервере
Функция НовыйПриходнаяНакладная()
	
	Документ = Документы.ПриходнаяНакладная.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.Фирма = гоФирма();
	Документ.КемСоздан = гоПользователь();
	Документ.Создан = ТекущаяДатаСеанса();
	Документ.Склад = Склад;
	Документ.Контрагент = Контрагент;
	Документ.Валюта = ПараметрыСеанса.БазоваяВалюта;
	//Документ.Окончательно = Ложь;
	Документ.Примечание = Примечание;
	
	Возврат Документ;
	
КонецФункции

&НаСервере
Процедура ЗаписатьПриходнуюНакладную(Документ, Результат)
	
	Если Документ = Неопределено Или Документ.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Документ.Записать();
	
	Для Каждого СтрокаТоваров Из Документ.Товары Цикл
		СтрокаТоваров.Партия = СоздатьПартию(Документ, СтрокаТоваров);
	КонецЦикла;
	
	Если ПроводитьДокументы Тогда
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Документ.Записать();
	КонецЕсли;
	
	Результат.ПриходныеНакладные = Результат.ПриходныеНакладные + 1;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПартию(Документ, СтрокаТоваров)
	
	Партия = Справочники.Партии.СоздатьЭлемент();
	Партия.Владелец = СтрокаТоваров.Номенклатура;
	Партия.Наименование = СтрокаТоваров.Серия;
	Партия.Серия = СтрокаТоваров.Серия;
	Партия.Док = Документ.Ссылка;
	Партия.Контрагент = Документ.Контрагент;
	Партия.Валюта = Документ.Валюта;
	Партия.Фирма = Документ.Фирма;
	Партия.ЦенаЗакупки = СтрокаТоваров.ЦенаЗакупки;
	Партия.ДатаПартии = Документ.Дата;
	Партия.Записать();
	
	Возврат Партия.Ссылка;
	
КонецФункции

&НаСервере
Функция СгенерироватьСерию(НомерСерии)
	
	Пока Истина Цикл
		Серия = "test" + Формат(ТекущаяДата(), "ДФ=yyyyMMddHHmmss") + Прав("000000" + СокрЛП(Строка(НомерСерии)), 6);
		Если НЕ СерияУжеСуществует(Серия) Тогда
			Возврат Серия;
		КонецЕсли;
		НомерСерии = НомерСерии + 1;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция СерияУжеСуществует(Серия)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Партии.Ссылка
	               |ИЗ
	               |	Справочник.Партии КАК Партии
	               |ГДЕ
	               |	Партии.Серия = &Серия";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура СоздатьДокументУстановкиЦен(ТаблицаНоменклатуры, Результат)
	
	ВидЦеныМелкийОпт = Справочники.ВидыЦен.МелкийОпт;
	ВидЦеныКрупныйОпт = Справочники.ВидыЦен.КрупныйОпт;
	
	Если НЕ ЗначениеЗаполнено(ВидЦеныМелкийОпт) Тогда
		ВызватьИсключение "Не найден предопределенный вид цены МелкийОпт.";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВидЦеныКрупныйОпт) Тогда
		ВызватьИсключение "Не найден предопределенный вид цены КрупныйОпт.";
	КонецЕсли;
	
	Документ = Документы.УстановкаЦен.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.Фирма = гоФирма();
	Документ.КемСоздан = гоПользователь();
	Документ.Создан = ТекущаяДатаСеанса();
	Документ.Склад = Склад;
	Документ.ПороговЦен = 2;
	Документ.Примечание = Примечание;
	
	Документ.ВидыЦен.Добавить().ВидЦены = ВидЦеныМелкийОпт;
	Документ.ВидыЦен.Добавить().ВидЦены = ВидЦеныКрупныйОпт;
	
	НомСтроки = 0;
	Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
		НомСтроки = НомСтроки + 1;
		ДобавитьСтрокуЦены(Документ, НомСтроки, СтрокаНоменклатуры.Номенклатура, ВидЦеныМелкийОпт, 100, 90, 80, 75);
		ДобавитьСтрокуЦены(Документ, НомСтроки, СтрокаНоменклатуры.Номенклатура, ВидЦеныКрупныйОпт, 8000, 7700, 7400, 7100);
	КонецЦикла;
	
	Если ПроводитьДокументы Тогда
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Документ.Записать();
	КонецЕсли;
	
	Результат.ДокументыУстановкиЦен = Результат.ДокументыУстановкиЦен + 1;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуЦены(Документ, НомСтроки, Номенклатура, ВидЦены, Цена0, Цена1, Цена2, Цена3)
	
	СтрокаЦены = Документ.Товары.Добавить();
	СтрокаЦены.НомСтроки = НомСтроки;
	СтрокаЦены.Номенклатура = Номенклатура;
	СтрокаЦены.ВидЦены = ВидЦены;
	СтрокаЦены.РазрешитьПродажу = Истина;
	СтрокаЦены.Цена0 = Цена0;
	СтрокаЦены.Цена1 = Цена1;
	СтрокаЦены.Порог1 = 5;
	СтрокаЦены.Цена2 = Цена2;
	СтрокаЦены.Порог2 = 10;
	СтрокаЦены.Цена3 = Цена3;
	СтрокаЦены.Порог3 = 15;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОкНаСервере(Ном)
	
	запр = Новый Запрос;
	запр.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	запр.Текст = "ВЫБРАТЬ
	             |	ПриходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	             |ГДЕ
	             |	ПриходнаяНакладная.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	             |	И НЕ ПриходнаяНакладная.Окончательно";
	Выборка = запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка.ПолучитьОбъект();
		Док.Окончательно = Истина;
		Док.Записать(РежимЗаписиДокумента.Проведение);
		ном = ном + 1;
	КонецЦикла;                               
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОк(Команда)
	ном = 0;
	УстановитьОкНаСервере(Ном); 
	Сообщить("Обработано: " + Ном);
КонецПроцедуры
